fine/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2412                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    inlet
    {
        type            patch;
        nFaces          40;
        startFace       42384;
    }
    outlet
    {
        type            patch;
        nFaces          40;
        startFace       42424;
    }
    slip
    {
        type            symmetry;
        inGroups        1(symmetry);
        nFaces          440;
        startFace       42464;
    }
    walls
    {
        type            wall;
        inGroups        1(wall);
        nFaces          472;
        startFace       42904;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          42880;
        startFace       43376;
    }
)

// ************************************************************************* //
