fine/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     pimpleFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         50;

deltaT          0.0001;

writeControl    runTime;

writeInterval   0.1;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

functions
{
    fieldAverage
    {
        type             fieldAverage;
        libs             (fieldFunctionObjects);
        executeControl   timeStep;
        executeInterval  1;
        writeControl     writeTime;
        writeInterval    1;
        startTime        10;

        fields
        (
            U
            {
                mean        on;
                prime2Mean  on;
                base        time;
            }

            p
            {
                mean        on;
                prime2Mean  on;
                base        time;
            }
        );
    }

    residuals
    {
        type             solverInfo;
        libs             ("libutilityFunctionObjects.so");
        fields           (U p);
        executeControl   timeStep;
        writeResidualFields yes;
        executeInterval  1;
        writeControl     writeTime;
        writeInterval    1;
        startTime        0;
    }


    probes
   {

    // Load the sampling library
    libs            (sampling);

    type            probes;

   // Name of the output folder
    name            probes;


   // Write at the same time as field outputs
    writeControl    writeTime;
    writeInterval   1;

   // Fields to probe
    fields
    (
        p
        U
    );


  // Probe point coordinates (x y z)
    probeLocations
    (
        // Inside Cavity
	(1.2 -0.5 0) //1
	(1.45 -0.5 0) //2
	(1.7  -0.5 0)  //3
	(2.2 -0.5 0) //4
	(1.2 -0.75 0) //5
	(1.45 -0.75 0) //6
	(1.7 -0.75 0) //7
	(2.2 -0.75 0)  //8

        // Outlet Region
	(2.2 -0.375 0) //9
	(2.825 -0.375 0) //10
	(3.45 -0.375 0) //11
	(4.075 -0.375 0) //12
	(2.825 -0.5 0) //13
	(3.45 -0.375 0) //14
	(4.075 -0.375 0) //15
      );
   }



}


// ************************************************************************* //

